[
    {
      "id": "1",
      "bookName": "The Silent Patient",
      "author": "Alex Michaelides", 
      "image": "https://i.ibb.co/F5M9jJT/kindpng-7318921.jpg",
      "bookReview": "The Silent Patient, written by Alex Michaelides, is a masterful psychological thriller that delves deep into the complexities of the human mind. At its core, the novel explores the profound silence of Alicia Berenson, a famous painter who seemingly has it all until she suddenly murders her husband and retreats into silence. The story unfolds through the perspective of Theo Faber, a psychotherapist who becomes obsessed with unlocking Alicia's secrets and uncovering the truth behind her inexplicable silence. As Theo delves deeper into Alicia's past and psyche, he is forced to confront his own demons and unravel the dark and twisted truths that lie hidden beneath the surface. With its gripping plot twists, richly drawn characters, and haunting atmosphere, The Silent Patient is a riveting read that will keep you on the edge of your seat until the very end.",
      "totalPages": 336,
      "rating": 4.6,
      "category": "Classic", 
      "tags": ["Young Adult", "Identity"],
      "publisher": "Celadon Books",
      "yearOfPublishing": 2019
    },
    {
      "id": "2",
      "bookName": "Before I Go to Sleep",
      "author": "S.J. Watson", 
      "image": "https://i.ibb.co/X2d0VGM/images-1.jpg",
      "bookReview": "Before I Go to Sleep, authored by S.J. Watson, is a gripping psychological thriller that will leave readers questioning the nature of memory and identity. The novel follows the story of Christine Lucas, who wakes up every morning with no memory of her past or who she is. As she struggles to piece together the fragments of her life, Christine relies on a journal she keeps hidden from her husband to uncover the truth. However, as she delves deeper into her own history, she discovers shocking secrets and betrayals that threaten to shatter her reality. Watson's expertly crafted narrative keeps readers guessing until the final revelation, making Before I Go to Sleep a captivating and Young Adultful read.",
      "totalPages": 368,
      "rating": 4.1,
      "category": "Classic",
      "tags": ["Young Adult", "Identity"],
      "publisher": "HarperCollins",
      "yearOfPublishing": 2011
    },
    {
      "id": "3",
      "bookName": "The Girl with the Dragon Tattoo",
      "author": "Stieg Larsson", 
      "image": "https://i.ibb.co/sPrLbkN/kindpng-81724-1.jpg",
      "bookReview": "The Girl with the Dragon Tattoo, penned by Stieg Larsson, is a captivating blend of mystery, Young Adult, and intrigue that will keep readers hooked from beginning to end. The novel introduces us to Mikael Blomkvist, an investigative journalist who is hired to solve the decades-old disappearance of a wealthy industrialist's niece. Alongside Lisbeth Salander, a brilliant but troubled hacker with a mysterious past, Blomkvist delves into a web of corruption, conspiracy, and family secrets that lead to unexpected revelations. Larsson's intricate plotting and multifaceted characters make The Girl with the Dragon Tattoo a compelling and immersive read that transcends the boundaries of the traditional mystery genre.",
      "totalPages": 672,
      "rating": 4.3,
      "category": "Classic",
      "tags": ["Young Adult", "Identity"],
      "publisher": "Norstedts Förlag",
      "yearOfPublishing": 2005
    },
    {
      "id": "4",
      "bookName": "The Secret History",
      "author": "Donna Tartt", 
      "image": "https://i.ibb.co/Q83BY46/attachment-95387987.jpg",
      "bookReview": "The Secret History, authored by Donna Tartt, is a haunting and atmospheric novel that explores the darker aspects of human nature and the consequences of unchecked ambition. Set in a secluded college campus, the story follows a group of privileged students who become entangled in a world of intellectualism, decadence, and moral decay. As they delve deeper into their studies and delve into increasingly dangerous territory, they find themselves consumed by secrets, guilt, and ultimately, murder. Tartt's lush prose and richly drawn characters make The Secret History a mesmerizing and thought-provoking read that lingers in the mind long after the final page.",
      "totalPages": 559,
      "rating": 4.5,
      "category": "Classic",
      "tags": ["Young Adult", "Identity"],
      "publisher": "Alfred A. Knopf",
      "yearOfPublishing": 1992
    },
    {
      "id": "5",
      "bookName": "Gone Girl",
      "author": "Gillian Flynn", 
      "image": "https://i.ibb.co/s6LMzmm/494-4945926-jeffrey-archer-books-hd-png-download.jpg",
      "bookReview": "Gone Girl, written by Gillian Flynn, is a twisty and darkly comedic tale of love, betrayal, and revenge that will keep readers guessing until the very end. The novel follows the story of Nick and Amy Dunne, a seemingly perfect couple whose marriage begins to unravel on their fifth wedding anniversary when Amy suddenly disappears under suspicious circumstances. As the media frenzy and police investigation intensify, Nick finds himself at the center of a storm of accusations and revelations that threaten to destroy his life. Flynn's razor-sharp wit and keen insight into the complexities of human relationships make Gone Girl a thrilling and unforgettable read that challenges the reader's perceptions at every turn.",
      "totalPages": 432,
      "rating": 4.4,
      "category": "Classic",
      "tags": ["Young Adult", "Identity"],
      "publisher": "Crown Publishing Group",
      "yearOfPublishing": 2012
    },
    {
      "id": "6",
      "bookName": "In the Woods",
      "author": "Tana French", 
      "image": "https://i.ibb.co/z4LTc05/attachment-106350991-1.jpg",
      "bookReview": "In the Woods, authored by Tana French, is a haunting and atmospheric mystery that seamlessly blends elements of psychological Young Adult with police procedural. The novel follows Detective Rob Ryan as he investigates the murder of a young girl in a small Irish town, a crime that bears striking similarities to an unsolved case from his own childhood. As Ryan delves deeper into the investigation, he is forced to confront his own demons and the trauma of his past, which he has long tried to bury. French's evocative prose and keen insight into the human psyche make In the Woods a gripping and unforgettable read that will keep readers guessing until the final revelation.",
      "totalPages": 429,
      "rating": 4.2,
      "category": "Classic",
      "tags": ["Young Adult", "Identity"],
      "publisher": "Viking Press",
      "yearOfPublishing": 2007
    }
]